---
layout: book
title:  "<나는 리뷰어다 2022> 혼자 공부하는 R 데이터분석"
date:   2022-05-29 10:23:35 +0900
category: bookreview
tags:
- book
- R
- analysis
classes: wide
published: true
booktitle : 혼자 공부하는 R 데이터분석
author: 강전희, 엄동란
bookcover: B6779219508_l.jpg
bookcategory: 데이터분석
stars: 4.5
book-link: https://www.hanbit.co.kr/store/books/look.php?p_code=B6779219508
---

처음 R을 만났을 때 생소한 문법과 기존 방식과 다른 형태의 프로그램으로 어려움이 있었습니다.
통계를 위한 데이터분석을 위해서 기존에는 SPSS등을 사용하였는데 R이 만들어지고부터 오픈 소스라서 그런지 더 많은 곳에서 사용이 되고 있는 것 같습니다.

이 도서는 R을 이용해서 처음 배우는 사람들이 쉽게 R을 적응하고 분석을 할 수 있는 도서입니다.


![](/images/reviewer_202205_01.JPG){: width="640" }


책은 8개의 큰 챕터로 이루어져 있습니다. 

- Chapter 1. 빅데이터와 R
- Chapter 2. 데이터 분석을 위한 기본 다지기
- Chapter 3. R 프로그래밍 익히기
- Chapter 4. 데이터 다루기
- Chapter 5. 데이터 가공하기
- Chapter 6. 데이터 시각화: ggplot2 패키지
- Chapter 7. 프로젝트 실력 다지기
- Chapter 8. 데이터 분석 보고서 경유하기

여타 다른 도서와 같이 R에 대한 설명과 설치 방법이 친절하게 설명되어 있습니다.
사소하게 지나갈 수 있는 문제들은 "여기서 잠깐" 같은 코너로 설명되어 있어 지나가면서 발생할 수 있는 어려움을 처리해 줍니다.

올해 나온 도서라 예제로 사용된 홈페이지들이 화면과 동일하여 사용자가 다운 받으러 들어갈 때 이질감이 없이 따라하기를 하면 똑같이 데이터를 얻을 수 있었습니다.

프로젝트로 실력 다지기 중에 하나의 내용입니다. 서울시 지역별 미세먼지 농도 차이를 다운 받은 데이터를 통해서 분석을 하는 예제입니다.

![](/images/reviewer_202205_03.png){: width="640" }

데이터를 제공하는 파일에서도 볼 수 있지만 최근 데이터를 직접 홈페이지에서 받아서 결과를 수행해 보았습니다. 예제는 2021년 1월 이지만 2022년 1월의 데이터를 받아서 동일하게 검증을 수행해 보았습니다.

![](/images/reviewer_202205_04.png){: width="640" }

t 검정으로 p-value가 0.05가 넘어서 통계적으로 유의하지 않다는 것을 확인 할 수 있었습니다.

R로 분석을 하기 위한 데이터를 가져오는 방법부터 그 데이터를 필요한 형태로 정제를 하는 방법까지 자세히 나와 있습니다. 
그 다음에 정제된 데이터를 바탕으로 분석하는 실습까지 자세히 나열되어 있어 혼자서도 할 수 있다고 하는 책 제목에 맞게 R을 익힐 수 있는 도서입니다.
ㄴ

```* 한빛미디어 <나는 리뷰어다> 활동을 위해서 책을 제공받아 작성된 서평입니다.```
